<!-- dflook/terraform-github-actions {"workspace":"default","backend":"cfa72ea316ceeeaf0919cf1f9a7f4dd216276581747870557f484ae11480b923","backend_type":"s3","plan_job_ref":"Job Validate pull request #9 at https://github.com/yardbirdsax/infra-k8slab/actions/runs/2896098043","plan_hash":"fa93fef7b96a74a75d2ad121577ca336fc1d07b734a6d7d5d561147e591b1c2b","plan_text_format":"text"} -->
Terraform plan in __terraform/vpc/us-east-2__
<details>
<summary>Plan: 2 to add, 0 to change, 0 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.vpc.aws_route_table_association.public[1] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = "*********************"
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_subnet.public[1] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-2a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.0.32/27"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "k8slab-public-us-east-2a"
          + "repo" = "yardbirdsax/infra-k8slab"
        }
      + tags_all                                       = {
          + "Name" = "k8slab-public-us-east-2a"
          + "repo" = "yardbirdsax/infra-k8slab"
        }
      + vpc_id                                         = "*********************"
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Validate pull request #9](https://github.com/yardbirdsax/infra-k8slab/actions/runs/2896098043)